app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
---
    def index
      @all_ratings = Movie.all_ratings

      if params.has_key?(:ratings)
        @ratings_to_show = params[:ratings].keys
        @ratings_to_show_hash = Hash[@ratings_to_show.collect {|key| [key, '1']}]
      else
        @ratings_to_show = []
      end

      @movies = Movie.with_ratings(@ratings_to_show)

      @title_header = ''
      @release_date = ''
      if params.has_key?(:sort_by)
        @movies = @movies.order(params[:sort_by])